#+TITLE: Source of https://jappieklooster.nl

# TODO add badge

* Deploy checklist
  
+ Check title to copy
+ https://reddit.com/r/jappie
    + Cross post in whatever is relevant, eg haskell programming reflex nixos
+ https://linkedin.com
+ https://facebook.com
+ https://twitter.com


* TODO website extensions

+ Reddit comments into static site
+ Justify paragraphs like latex

** TODO Use hakyl instead of pelican
   I'd prefer having everything in haskell because
   python module system is just too magical.

   I'll postpone this untill I actually need something.
*** TODO Find reddit auto poster substitue in haskell
    (should be rather trivial)
*** TODO Port over layout

** Org export
*** TODO Fix citations
+ Should be faster
  + Maybe going full python? IDK how far that is or how much work
+ TOC shouldn't be generated with ID on overview page.
** Layout ideas

*** Body based wrapping
http://benhoyt.com/writings/pyast64/

Also looks really clean.
Although the word spacing is a weird choice

** NGINX
*** tracking
1. Should move configuration file into the version controll
2. Publish script should overwrite the config file from version controlled one

*** redericts
Make them all temporary, don't want browsers to cache them.


** Search performance
*** TODO Setup amp?
https://www.ampproject.org/docs/fundamentals/spec#html-tags

It seems actually quit doable.
The only issue is mathjx realy.
However currently nobody is coming on my website trough search so who cares.

*** TODO Setup structured
??

** Replace straight quotes with curly
Probably can just add a filter in pelican or something.
Make a plugin that fixes it for everyone?

https://practicaltypography.com/straight-and-curly-quotes.html

* Troubleshooting
  To help me trough the dark times when the ductape fails.
  
** Nixx build fails
   Make sure the submodules are cloned properly:

    git@github.com:jappeace/pelican-plugins.git 
    jappie branch
** Org fails
   Probably because of that orgmode bug where they say it isn't allowed to do
   compilation. (the id then doesn't get generated which makes it fail entrily).
   Test by trying to just =C-c C-c= some random org source block.
   Try recompiling elpa =m x recompile-elpa= and see if it loads now.

  https://github.com/syl20bnr/spacemacs/issues/7641

  =rm -rf .emacs.d/elpa/org-plus-contrib-20180806= works.
**** Test blcok
#+BEGIN_SRC emacs-lisp
(+ 4 2)
#+END_SRC

#+RESULTS:
: 6
   
*** wrong type arg (stringp, null)
If it's only the thesis it's the plant uml blocks. recompile elpa,
make sure plantuml is enable (should be).

Also I found a binary search was a good way to confirm that it's the plantuml
blocks.


It can also be the case that the org exporter demands an author from the format,
The fix is to delete it as done in: https://github.com/jappeace/pelican-plugins/commit/ea470ea2f1e333733418ea15f12bdfccdf1526c4

** Assets not found in template
   Set the =SASS_PATH= to theme/static/css.
   
** Web assets doesn't render
   Mask jinja 2.9 for webassets 0.12, see https://bugs.gentoo.org/641766

* Links
[[https://www.google.com/webmasters/tools/site-message-view?hl=en_GB&authuser=0&siteUrl=https://jappieklooster.nl/][Google crawl report]], I stumbled on that when configuring a static site in
buckets.

https://analytics.google.com/analytics/web/

* Atribution
Got the insperation for a webise from 
[[http://creativecommons.org/licenses/by-sa/4.0/][eevee]]

So this is powered by [[http://docs.getpelican.com/en/stable/][pelican]].
(and the org-mode plugin, org mode best mode)

